In [1]:
import numpy as np
import pandas as pd

In [2]:
label = ['satu', 'dua', 'tiga', 'empat']

In [3]:
angka = [10, 20, 30, 40]

In [4]:
np_angka = np.array(angka)
np_angka

array([10, 20, 30, 40])

In [5]:
d = {'satu':20, 'dua':30, 'tiga':40}

In [6]:
pd.Series(data=angka)

0    10
1    20
2    30
3    40
dtype: int64

In [7]:
dataku = pd.Series(data=angka, index=label)

In [8]:
dataku

satu     10
dua      20
tiga     30
empat    40
dtype: int64

In [9]:
dataku['tiga']

30

In [10]:
pd.Series(d)

satu    20
dua     30
tiga    40
dtype: int64

In [11]:
dataku.to_frame()

        0
satu   10
dua    20
tiga   30
empat  40

In [12]:
dataku = dataku.to_frame()

In [13]:
dataku

        0
satu   10
dua    20
tiga   30
empat  40

In [14]:
d2 = {'satu':20, 'dua':30, 'tiga':40, 'empat':50, 'lima':70}

In [15]:
dataku = pd.Series(d)

In [16]:
dataku2 = pd.Series(d2)

In [17]:
dataku + dataku2

dua      60.0
empat     NaN
lima      NaN
satu     40.0
tiga     80.0
dtype: float64

In [18]:
np.random.seed(100)

In [19]:
dataku3 = pd.DataFrame(np.random.randn(3,5), ['A','B','C'], ['satu', 'dua', 'tiga', 'empat', 'lima'])

In [20]:
dataku3

       satu       dua      tiga     empat      lima
A -1.749765  0.342680  1.153036 -0.252436  0.981321
B  0.514219  0.221180 -1.070043 -0.189496  0.255001
C -0.458027  0.435163 -0.583595  0.816847  0.672721

In [21]:
dataku3['dua']

A    0.342680
B    0.221180
C    0.435163
Name: dua, dtype: float64

In [22]:
dataku3['enam'] = dataku3['empat'] + dataku3['lima']

In [23]:
dataku3

       satu       dua      tiga     empat      lima      enam
A -1.749765  0.342680  1.153036 -0.252436  0.981321  0.728885
B  0.514219  0.221180 -1.070043 -0.189496  0.255001  0.065506
C -0.458027  0.435163 -0.583595  0.816847  0.672721  1.489568

In [24]:
dataku3.drop('tiga',axis=1)

       satu       dua     empat      lima      enam
A -1.749765  0.342680 -0.252436  0.981321  0.728885
B  0.514219  0.221180 -0.189496  0.255001  0.065506
C -0.458027  0.435163  0.816847  0.672721  1.489568

In [25]:
dataku3 = dataku3.drop('tiga',axis=1)

In [26]:
dataku3

       satu       dua     empat      lima      enam
A -1.749765  0.342680 -0.252436  0.981321  0.728885
B  0.514219  0.221180 -0.189496  0.255001  0.065506
C -0.458027  0.435163  0.816847  0.672721  1.489568

In [27]:
dataku3.drop('B',axis=0, inplace=True)

In [28]:
dataku3

       satu       dua     empat      lima      enam
A -1.749765  0.342680 -0.252436  0.981321  0.728885
C -0.458027  0.435163  0.816847  0.672721  1.489568

In [29]:
dataku3.shape

(2, 5)

In [31]:
dataku_bol = dataku3 < 0
dataku_bol

   satu    dua  empat   lima   enam
A  True  False   True  False  False
C  True  False  False  False  False

In [33]:
dataku3[dataku_bol]

       satu  dua     empat  lima  enam
A -1.749765  NaN -0.252436   NaN   NaN
C -0.458027  NaN       NaN   NaN   NaN

In [34]:
dataku4 = pd.DataFrame(np.random.randn(3,5), ['A','B','C'], ['satu', 'dua', 'tiga', 'empat', 'lima'])

In [35]:
dataku4

       satu       dua      tiga     empat      lima
A -0.104411 -0.531280  1.029733 -0.438136 -1.118318
B  1.618982  1.541605 -0.251879 -0.842436  0.184519
C  0.937082  0.731000  1.361556 -0.326238  0.055676

In [38]:
dataku4[dataku4['tiga'] < 0]

       satu       dua      tiga     empat      lima
B  1.618982  1.541605 -0.251879 -0.842436  0.184519

In [39]:
hasil = dataku4[dataku4['tiga'] < 0]
hasil

       satu       dua      tiga     empat      lima
B  1.618982  1.541605 -0.251879 -0.842436  0.184519

In [41]:
dataku4 > 1

    satu    dua   tiga  empat   lima
A  False  False   True  False  False
B   True   True  False  False  False
C  False  False   True  False  False

In [42]:
dat_boolean = dataku4 > 1

In [43]:
dat_boolean

    satu    dua   tiga  empat   lima
A  False  False   True  False  False
B   True   True  False  False  False
C  False  False   True  False  False